In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("D:/ISB/datasets/data_house/data_house.csv",index_col=0)
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,20141013T000000,221900.0,3,1.00,1180,5650,1.0,0,0,...,7,1180,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,20141209T000000,538000.0,3,2.25,2570,7242,2.0,0,0,...,7,2170,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,20150225T000000,180000.0,2,1.00,770,10000,1.0,0,0,...,6,770,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,20141209T000000,604000.0,4,3.00,1960,5000,1.0,0,0,...,7,1050,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,20150218T000000,510000.0,3,2.00,1680,8080,1.0,0,0,...,8,1680,0,1987,0,98074,47.6168,-122.045,1800,7503

## Average price per bedroom count

In [2]:
bedroom_price = df.groupby("bedrooms")["price"].mean().sort_values(ascending=False)
bedroom_price

bedrooms
8     1.105077e+06
7     9.511847e+05
9     8.939998e+05
6     8.255206e+05
10    8.193333e+05
5     7.865998e+05
33    6.400000e+05
4     6.354195e+05
11    5.200000e+05
3     4.662321e+05
0     4.095038e+05
2     4.013727e+05
1     3.176429e+05
Name: price, dtype: float64

## Group by Year Built (Market Trend Analysis)

In [3]:
year_price = df.groupby("yr_built")["price"].mean().sort_values(ascending=False)
year_price.head(10)

yr_built
1933    772050.000000
2015    759785.157895
1905    752977.986486
2001    741030.796721
1909    696135.159574
2014    683681.754919
2000    681789.169725
2013    678545.452736
1907    676257.246154
1902    673007.407407
Name: price, dtype: float64

## Group Multiple Columns (Advanced EDA – High Impact)

In [4]:
multi_group = df.groupby(["bedrooms", "bathrooms"])["price"].mean().sort_values(ascending=False)
multi_group.head(10)

bedrooms  bathrooms
6         8.00         7.700000e+06
          7.75         6.885000e+06
          6.00         5.300000e+06
5         6.75         4.668000e+06
          5.75         3.745000e+06
          6.25         3.094000e+06
          5.50         3.052000e+06
          5.25         3.035450e+06
6         4.75         2.653333e+06
5         6.00         2.557750e+06
Name: price, dtype: float64

### Cheapest houses

In [6]:
df.sort_values(by="price", ascending=True).head(5)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
1149,3421079032,20150217T000000,75000.0,1,0.00,670,43377,1.0,0,0,...,3,670,0,1966,0,98022,47.2638,-121.906,1160,42882
15293,40000362,20140506T000000,78000.0,2,1.00,780,16344,1.0,0,0,...,5,780,0,1942,0,98168,47.4739,-122.280,1700,10387
465,8658300340,20140523T000000,80000.0,1,0.75,430,5050,1.0,0,0,...,4,430,0,1912,0,98014,47.6499,-121.909,1200,7500
16198,3028200080,20150324T000000,81000.0,2,1.00,730,9975,1.0,0,0,...,5,730,0,1943,0,98168,47.4808,-122.315,860,9000
8274,3883800011,20141105T000000,82000.0,3,1.00,860,10426,1.0,0,0,...,6,860,0,1954,0,98146,47.4987,-122.341,1140,11250

### Top expensive houses

In [7]:
df.sort_values(by="price", ascending=False).head(5)

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
7252,6762700020,20141013T000000,7700000.0,6,8.00,12050,27600,2.5,0,3,...,13,8570,3480,1910,1987,98102,47.6298,-122.323,3940,8800
3914,9808700762,20140611T000000,7062500.0,5,4.50,10040,37325,2.0,1,2,...,11,7680,2360,1940,2001,98004,47.6500,-122.214,3930,25449
9254,9208900037,20140919T000000,6885000.0,6,7.75,9890,31374,2.0,0,4,...,13,8860,1030,2001,0,98039,47.6305,-122.240,4540,42730
4411,2470100110,20140804T000000,5570000.0,5,5.75,9200,35069,2.0,0,0,...,13,6200,3000,2001,0,98039,47.6289,-122.233,3560,24345
1448,8907500070,20150413T000000,5350000.0,5,5.00,8000,23985,2.0,0,4,...,12,6720,1280,2009,0,98004,47.6232,-122.220,4600,21750

## creating price categories for better understanding of the house prices

In [10]:
df["price_category"] = df["price"].apply(
    lambda x: "Low" if x < 300000 else ("Medium" if x < 800000 else "High")
)
df["price_category"].value_counts()

price_category
Medium    14174
Low        4437
High       3002
Name: count, dtype: int64

## Group by Price Category
## Insight:

#### Do expensive houses always have higher living area?

In [12]:
df.groupby("price_category")["sqft_living"].mean()

price_category
High      3373.278814
Low       1417.293442
Medium    2013.387823
Name: sqft_living, dtype: float64